'''
(1) 2**Nは最大でも計算処理が可能。またKが10**9でも毎回1/2をすると実は計算量はそこまで重くない。以上より逐次的な処理の実行を通じて答えを導出する線を考える。
(2) 11を2個の数列にする際にはいくつかあるが最小に収まるのは5と6。12なら6と6だし、13なら6と7とわかる。このことから基本的に1/2をしてあげて割り切れない時は片方に+1をすると良いかもしれない。
(3) グラフにするとイメージが着くかもしれないのでKを根とした木構造で毎回1/2をしていく。その際に割り切れないケースは片方に+1をしておく。
(4) 数列の並び替え次第ではアンバランスさが大きくなってしまうので悩んだが、(3)の方法を何回か検証していくうちにこの方法なら最大でも1にしかならなさそう。
(5) よって(1)と(3)の処理をキューを使って表現し、割割り切れなケースがあった時は1として回答することにした。
'''
from collections import deque

N, K = map(int, input().split()) # 取得例：1 2

res = 0
dq = deque([K])
n = 2**N
while len(dq) < n:
    new_dq = deque()
    while len(dq):
        a = dq.popleft()
        if a%2 == 0:
            new_dq.append(a//2)
            new_dq.append(a//2)
        else:
            new_dq.append(a//2)
            new_dq.append(a//2+1)
            res = 1

    dq = new_dq

print(res)
print(*dq)