'''
※解説AC
(1) DPも片隅にはあったが偶奇などの法則性がないかの考察に終始していたが、結局は何もわからずじまいだった
(2) ビット演算を扱う問題で結合性などの扱いに慣れていないことも解答に辿り着けない原因になっていたかも
(3) 今回の問題は0と1の2つの状態しか持たないこととその個数にもっと注目するべきだった
    → NANDの表を作成しておくと考察が捗っていたかも
(4) いま注目している右側の点の1つ前において、左端の位置を変えた時の0と1になる個数を数えておく
(5) そしてそれらをもとにしていまの右側のもとに0と1になる個数を更新し、ansに対して1になる個数を加算
(6) 状態を数個のように少数しか持たず、全探索ををしたいパターンはDPを強く疑う姿勢を持つべき 
'''
N = int(input())
A = input()

zero, one = 0, 0
ans = 0
for a in A:
    if a == '0':
        zero, one = 1, zero + one
    else:
        zero, one = one, zero + 1
    ans += one

print(ans)