'''
(1) bit全探索をすれば良いが最短の数を導出できるが、それだと当然TLE
(2) Tの制限が小さいので0(N*T)でも間に合うことを踏まえるとDPが使えるかもしれない
(3) しかし今回は2つ扱うものがあるので、そこをどうにかしなければいけない
(4) ここで片方のみに着目することを考えてみると、1つ目のオーブンで作る料理の時間の総数を求めたときに、全体-1つ目の時間=2つ目の時間となることに気づく
(5) 今回のケースでも片方のみに着目し、もう片方はそもそも全て処理を行なわないという視点が大事だった
'''
T = list(map(int, input().split()))
S = sum(T)

dp = [False] * (S + 1)
dp[0] = True
for t in T:
    for i in range(S, t - 1, -1):
        if dp[i - t]:
            dp[i] = True

ans = S
# 部分和を総当たりするともう片方の時間が求められるので、双方を比較した時の最大値が作業時間となる
for i in range(S + 1):
    if dp[i]:
        ans = min(ans, max(i, S - i))

print(ans)